project/BUNGE_sap_ws_clients/trunk/src/main/docs/req2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:APAccountGetOpenItems>
         <CompanyCode>1000</CompanyCode>
         <KeyDate>2009-07-01</KeyDate>
         <LineItems>
            <!--Zero or more repetitions:-->
            <item>
               <CompCode></CompCode>
               <Vendor></Vendor>
               <SpGlInd></SpGlInd>
               <ClearDate></ClearDate>
               <ClrDocNo></ClrDocNo>
               <AllocNmbr></AllocNmbr>
               <FiscYear></FiscYear>
               <DocNo></DocNo>
               <ItemNum></ItemNum>
               <PstngDate></PstngDate>
               <DocDate></DocDate>
               <EntryDate></EntryDate>
               <Currency></Currency>
               <LocCurrcy></LocCurrcy>
               <RefDocNo></RefDocNo>
               <DocType></DocType>
               <FisPeriod></FisPeriod>
               <PostKey></PostKey>
               <DbCrInd></DbCrInd>
               <BusArea></BusArea>
               <TaxCode></TaxCode>
               <LcAmount></LcAmount>
               <AmtDoccur></AmtDoccur>
               <LcTax></LcTax>
               <TxDocCur></TxDocCur>
               <ItemText></ItemText>
               <Branch></Branch>
               <BlineDate></BlineDate>
               <Pmnttrms></Pmnttrms>
               <DsctDays1></DsctDays1>
               <DsctDays2></DsctDays2>
               <Netterms></Netterms>
               <DsctPct1></DsctPct1>
               <DsctPct2></DsctPct2>
               <DiscBase></DiscBase>
               <DscAmtLc></DscAmtLc>
               <DscAmtDc></DscAmtDc>
               <PymtMeth></PymtMeth>
               <PmntBlock></PmntBlock>
               <Fixedterms></Fixedterms>
               <InvRef></InvRef>
               <InvYear></InvYear>
               <InvItem></InvItem>
               <DunnBlock></DunnBlock>
               <DunnKey></DunnKey>
               <LastDunn></LastDunn>
               <DunnLevel></DunnLevel>
               <DunnArea></DunnArea>
               <WTaxCode></WTaxCode>
               <WTaxBase></WTaxBase>
               <WiTaxAmt></WiTaxAmt>
               <DocStatus></DocStatus>
               <NxtDoctyp></NxtDoctyp>
               <VatRegNo></VatRegNo>
               <ExemptNo></ExemptNo>
               <WTaxExpt></WTaxExpt>
               <ReasonCde></ReasonCde>
               <Pmtmthsupl></Pmtmthsupl>
               <RefKey1></RefKey1>
               <RefKey2></RefKey2>
               <TCurrency></TCurrency>
               <Amount></Amount>
               <NetAmount></NetAmount>
               <Name></Name>
               <Name2></Name2>
               <Name3></Name3>
               <Name4></Name4>
               <PostlCode></PostlCode>
               <City></City>
               <Country></Country>
               <Street></Street>
               <PoBox></PoBox>
               <PobxPcd></PobxPcd>
               <PobkCurac></PobkCurac>
               <BankAcct></BankAcct>
               <BankKey></BankKey>
               <BankCtry></BankCtry>
               <TaxNo1></TaxNo1>
               <TaxNo2></TaxNo2>
               <Tax></Tax>
               <EqualTax></EqualTax>
               <Region></Region>
               <CtrlKey></CtrlKey>
               <InstrKey></InstrKey>
               <PayeeCode></PayeeCode>
               <Langu></Langu>
               <BillLife></BillLife>
               <BeTaxcode></BeTaxcode>
               <BilltaxLc></BilltaxLc>
               <BilltaxFc></BilltaxFc>
               <LcColChg></LcColChg>
               <CollCharg></CollCharg>
               <ChgsTxCd></ChgsTxCd>
               <IssueDate></IssueDate>
               <Usagedate></Usagedate>
               <BillUsage></BillUsage>
               <Domicile></Domicile>
               <Drawer></Drawer>
               <CtrbnkLoc></CtrbnkLoc>
               <DrawCity1></DrawCity1>
               <Drawee></Drawee>
               <DrawCity2></DrawCity2>
               <DisctDays></DisctDays>
               <DisctRate></DisctRate>
               <Accepted></Accepted>
               <Billstatus></Billstatus>
               <PrtestInd></PrtestInd>
               <BeDemand></BeDemand>
               <ObjType></ObjType>
               <RefDoc></RefDoc>
               <RefOrgUn></RefOrgUn>
               <ReversalDoc></ReversalDoc>
               <SpGlType></SpGlType>
               <NegPostng></NegPostng>
               <RefDocNoLong></RefDocNoLong>
            </item>
         </LineItems>
         <!--Optional:-->
         <NotedItems></NotedItems>
         <Vendor>0000600001</Vendor>
      </urn:APAccountGetOpenItems>
   </soapenv:Body>
</soapenv:Envelope>

